#+TITLE: Doubly Linked List (DLL)
#+DATE: [2026-04-04 Sat]
#+STARTUP: overview
#+FILETAGS: :data_structure:pointers:bidirectional:
#+PROPERTY: header-args:cpp :flags -std=c++17 :results scalar :exports both

Table of Contents                                                     :TOC:
- [[#mental-model-the-bidirectional-train][Mental Model: The Bidirectional Train]]
- [[#the-structure][The Structure]]
- [[#core-operations-visualized][Core Operations Visualized]]
- [[#interactive-lab-insert-at-tail][Interactive Lab: Insert at Tail]]
- [[#recursive-vs-iterative-reversal][Recursive vs Iterative Reversal]]
- [[#memory-anchors-the-forget-me-nots][Memory Anchors (The "Forget-Me-Nots")]]
- [[#practice-challenges][Practice Challenges]]

* Interactive Lab: Insert at Tail
This demonstrates the importance of updating the ~prev~ link.

#+BEGIN_SRC cpp
  #include <iostream>

  struct Node {
      int data;
      Node *next, *prev;
      Node(int val) : data(val), next(nullptr), prev(nullptr) {}
  };

  void insertAtTail(Node*& head, int val) {
      Node* newNode = new Node(val);
      if (!head) {
          head = newNode;
          return;
      }
      Node* temp = head;
      while (temp->next) temp = temp->next;

      temp->next = newNode;
      newNode->prev = temp; // CRITICAL STEP
  }

  void printForward(Node* head) {
      while (head) {
          std::cout << head->data << " <-> ";
          if (!head->next) std::cout << "NULL";
          head = head->next;
      }
      std::cout << std::endl;
  }

  int main() {
      Node* head = nullptr;
      insertAtTail(head, 10);
      insertAtTail(head, 20);
      insertAtTail(head, 30);
      printForward(head);
      return 0;
  }
#+END_SRC

#+RESULTS:
: 10 <-> 20 <-> 30 <-> NULL

